Revit 2024 API
ApplicationEntryPoint.CreateRibbonPanel Method (String)
Namespace: Autodesk.Revit.UI.Macros
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public override RibbonPanel CreateRibbonPanel(
	string panelName
)
Visual Basic
Public Overrides Function CreateRibbonPanel ( _
	panelName As String _
) As RibbonPanel
Visual C++
public:
virtual RibbonPanel^ CreateRibbonPanel(
	String^ panelName
) override
Parameters
panelName
Type: System.String
See Also
ApplicationEntryPoint Class
CreateRibbonPanel Overload
Autodesk.Revit.UI.Macros Namespace